IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MSG PIC X(20) VALUE "Hello, World!".

PROCEDURE DIVISION.
    DISPLAY MSG.
    STOP RUN.